## Understanding Pandas

#### Step:01 Loading your data

In [1]:
#pip install pandas
import pandas as pd
from urllib.request import urlretrieve

In [5]:
bios_url = "https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/bios.csv"

In [8]:
urlretrieve(bios_url,"dfbios.csv")

('dfbios.csv', <http.client.HTTPMessage at 0x111b86630>)

In [2]:
coffee_url = "https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv"

In [4]:
urlretrieve(coffee_url , "dfcoffee.csv")

('dfcoffee.csv', <http.client.HTTPMessage at 0x111b841a0>)

#### Loading dataset

In [78]:
pokieme = pd.read_csv('pokemon_data.csv') # reading in csv dataset
# pokieme_in_excel_format = pd.read_excel('pokemon_data.xlsx')
# pokieme_in_text_format = pd.read_csv('pokemon_data.csv' , delimiter='\t') # reading in text dataset
bios = pd.read_csv('dfbios.csv')
coffee = pd.read_csv('dfcoffee.csv')


# pokieme_in_csv_format #printing tht data
#print(pokieme_in_excel_forma)  print like this too

#### Reading the head of dataset

In [ ]:
pokieme.head() #here you can choose your head

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

#### Reading the tail of dataset

In [ ]:
pokieme.tail()  # this is for tail ie last

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
795,719,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

#### Getting all the coloumns

In [ ]:
pokieme.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

#### reading that specific coloumn

In [ ]:
# <!-- print(pokieme['Name']) #OG FORMAT -->
pokieme.Name #EASY WAY
# <!-- pokieme['Name'] -->

0                  Bulbasaur
1                    Ivysaur
2                   Venusaur
3      VenusaurMega Venusaur
4                 Charmander
               ...
795                  Diancie
796      DiancieMega Diancie
797      HoopaHoopa Confined
798       HoopaHoopa Unbound
799                Volcanion
Name: Name, Length: 800, dtype: object

#### Accessing  rows of that coloum

In [ ]:
pokieme['Name'][45:60] #accessing name fro 45 to 59 perticular coloumn

45    Wigglytuff
46         Zubat
47        Golbat
48        Oddish
49         Gloom
50     Vileplume
51         Paras
52      Parasect
53       Venonat
54      Venomoth
55       Diglett
56       Dugtrio
57        Meowth
58       Persian
59       Psyduck
Name: Name, dtype: object

In [ ]:

print(pokieme.iloc[70:72]) #whole row

     #                   Name   Type 1 Type 2  HP  Attack  Defense  Sp. Atk  \
70  65               Alakazam  Psychic    NaN  55      50       45      135
71  65  AlakazamMega Alakazam  Psychic    NaN  55      50       65      175

    Sp. Def  Speed  Generation  Legendary
70       95    120           1      False
71       95    150           1      False

#### accesing multiple coloumns

In [ ]:
pokieme[['Name','Type 1','Type 2']]  #accesing multiple coloumns

                      Name   Type 1  Type 2
0                Bulbasaur    Grass  Poison
1                  Ivysaur    Grass  Poison
2                 Venusaur    Grass  Poison
3    VenusaurMega Venusaur    Grass  Poison
4               Charmander     Fire     NaN
..                     ...      ...     ...
795                Diancie     Rock   Fairy
796    DiancieMega Diancie     Rock   Fairy
797    HoopaHoopa Confined  Psychic   Ghost
798     HoopaHoopa Unbound  Psychic    Dark
799              Volcanion     Fire   Water

[800 rows x 3 columns]

#### Read a specific location(R,C)

In [ ]:
print(pokieme.iloc[2,1]) #first is from coloumn and second is from row 
#in this this wiil access from index 2 in coloumn and 1 index in row
print(pokieme.iloc[795,2])

Venusaur
Rock

## creating your own dtaaframe and working with that

####how to create a dataframe

In [ ]:
sample_df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["A","B","C"] , index=["x", "y", "z"])

In [ ]:
sample_df.head(2)

   A  B  C
x  1  2  3
y  4  5  6

In [ ]:
sample_df.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
sample_df

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [ ]:
sample_df.index.tolist() ##dispaly index of the dataframe

['x', 'y', 'z']

In [ ]:
sample_df.info() #display infoof that dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [ ]:
sample_df. describe()  # display all the importanat calculation of that dataframe

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [ ]:
sample_df['A'].unique() #display values of each given/specific columns

array([1, 4, 7])

In [ ]:
sample_df.shape #display shape / how amy rows and columns that datframe has

(3, 3)

In [ ]:
sample_df.size #size of that dataframe

9

###Accesiing data with pandas

In [36]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [ ]:
coffee.sample(10) #display random sample from the dataset from csv

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
3     Tuesday       Latte          20
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
9      Friday       Latte          35
10   Saturday    Espresso          45
1      Monday       Latte          15
13     Sunday       Latte          35
12     Sunday    Espresso          45
8      Friday    Espresso          45

In [ ]:
coffee.sample(10, random_state=1)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35

#### loc and iloc      {df.loc[#rows.#coloumns]}

In [ ]:
coffee.loc[[0,1,2]] #display first 3 coloumns

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [ ]:
coffee.loc[0:3] #from index 0 t0 3

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [ ]:

coffee.loc[5:] #after index 5

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [46]:
coffee.loc[:5] #before index 5

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [ ]:
coffee.loc[ 5:12 , ["Day"]] #from 5 to 12 IN day day coloumn

          Day
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday

In [ ]:
coffee.loc[:,["Day","Units Sold"]]

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

## iloc (only use index values)

In [56]:
coffee.index

RangeIndex(start=0, stop=14, step=1)

In [81]:
coffee.loc["Monday":"Wednesday"]

Empty DataFrame
Columns: [Day, Coffee Type, Units Sold]
Index: []

In [ ]:
#how to modify your data
#syntax = df.loc[indexvalue , [columnname]]=chnaged value

In [80]:
coffee.loc[1, "Units Sold"] = 10

In [82]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

## How to acess specific values (iat at)

#### iat = this will acess a single value for a rows/coloumns pair by integer position 
      df.iat[row_index,coloumns_index]

#### at = acessinging a single value for a row / coloumns label pair 
     df.at[rowlabel,coloumnlabel]

## Ascending/Desending

In [ ]:
coffee.sort_values(["Units Sold"]) # this will arrange the value of thta column in ascending order

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [ ]:
coffee.sort_values(["Units Sold"], ascending=False) # this will arrange in descending order

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          10

In [ ]:
coffee.sort_values(["Day","Units Sold"], ascending=[0,1]) #1=ascendinh 0- descending

          Day Coffee Type  Units Sold
5   Wednesday       Latte          25
4   Wednesday    Espresso          35
3     Tuesday       Latte          20
2     Tuesday    Espresso          30
7    Thursday       Latte          30
6    Thursday    Espresso          40
13     Sunday       Latte          35
12     Sunday    Espresso          45
11   Saturday       Latte          35
10   Saturday    Espresso          45
1      Monday       Latte          10
0      Monday    Espresso          25
9      Friday       Latte          35
8      Friday    Espresso          45

## #iterating 
# acess rowvise data

In [ ]:
for index, rows in coffee.iterrows():  #iterating over each rows calling the rows one be one 
    print(rows)
    #print(index)
    print('\n')

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object


Day            Monday
Coffee Type     Latte
Units Sold         10
Name: 1, dtype: object


Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object


Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object


Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object


Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object


Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object


Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object


Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object


Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object


Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object


Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object


Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object


Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

## Filtering Data

In [124]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-FranÃ§ois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,PyrÃ©nÃ©es-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,AndrÃ© Foussard,1899-05-19,Niort,Deux-SÃ¨vres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [99]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-FranÃ§ois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,PyrÃ©nÃ©es-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [115]:
bioss=bios.loc[bios['height_cm']>215,['name','height_cm']]
bioss

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            JÄnis KrÅ«miÅ†Å¡      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko VrankoviÄ‡      217.0
7376      Eurelijus Å½ukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           FrÃ©dÃ©ric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto DueÃ±as      221.0
107408       Peter John Ramos      219.0
112312           Stanko BaraÄ‡      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          OndÅ™ej BalvÃ­n      216.0
139365         Moustapha Fall      218.0

In [122]:
bioss.sort_values(["height_cm"])

                         name  height_cm
118663         Timofey Mozgov      216.0
123850         Tyson Chandler      216.0
121694            Salah Mejri      216.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
138671          OndÅ™ej BalvÃ­n      216.0
112332    Andreas Glyniadakis      216.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
7281         Stojko VrankoviÄ‡      217.0
112312           Stanko BaraÄ‡      217.0
7074           Paulo da Silva      217.0
52608         Aleksey Kazakov      217.0
130461                Zhou Qi      217.0
5583     Paulinho Villas Boas      217.0
130460               Li Muhao      218.0
112337          Hamed Haddadi      218.0
7376      Eurelijus Å½ukauskas      218.0
139365         Moustapha Fall      218.0
6420            JÄnis KrÅ«miÅ†Å¡      218.0
5796            Andy Campbell      218.0
5716                 Uwe Blab      218.0
82100           FrÃ©dÃ©ric Weis      218.0
107408       Peter John Ramos      219.0
118676        Dmitry Musersky      219.0
7188       Vladimir Tkachenko      220.0
6504              Luc Longley      220.0
5089       Viktor Pankrashkin      220.0
89075          Roberto DueÃ±as      221.0
120266           Zhang Zhaoxu      221.0
5673           Gunther Behnke      221.0
6978          Arvydas Sabonis      223.0
5781           Tommy Burleson      223.0
89070                Yao Ming      226.0

### multiple condition

In [129]:
bios[(bios['height_cm']>215)&(bios['born_country']=='USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

### STRING OPERTAION

In [139]:
bios[bios['name'].str.contains("Keith", na=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [143]:

bios[bios['name'].str.contains("Keith|Wallace" ,case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2216,2226,Wallace Bryant,1863-12-19,Melrose,Massachusetts,USA,United States,169.0,NaN,1953-05-02
3242,3254,B. J. Wallace,1971-05-18,Mobile,Alabama,USA,United States,190.0,89.0,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
...,...,...,...,...,...,...,...,...,...,...
132575,135452,Shawn Dingilius-Wallace,1994-07-26,NaN,NaN,NaN,Palau,184.0,93.0,NaN
134189,137224,Lloyd Wallace,1995-02-13,Southampton,England,GBR,Great Britain,179.0,NaN,NaN
137246,140596,Bernadette Wallace,1989-08-08,NaN,NaN,NaN,Australia,NaN,NaN,NaN
138135,141527,Jamie Wallace,1999-09-14,Vancouver,British Columbia,CAN,Canada,NaN,NaN,NaN
139683,143160,Zach Wallace,1999-09-29,Redhill,England,GBR,Great Britain,NaN,NaN,NaN

#### regex

#### regex = false (turn of exact match of the name that you have given)

### isin

In [145]:
bios[bios['name'].isin(["Keith"])]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [149]:
bios[bios['born_country'].isin(["USA","FRA"])]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-FranÃ§ois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,PyrÃ©nÃ©es-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,BrianÃ§on,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN
145498,149225,AndrÃ© Foussard,1899-05-19,Niort,Deux-SÃ¨vres,FRA,France,166.0,NaN,1986-03-18

In [151]:
bios[bios['born_country'].isin(["USA","FRA"])& (bios['name'].str.startswith("Keith"))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
50929,51288,Keith Carter,1924-08-30,Akron,Ohio,USA,United States,NaN,NaN,2013-05-03
51185,51544,Keith Russell,1948-01-15,Mesa,Arizona,USA,United States,188.0,73.0,NaN
52913,53288,Keith Erickson,1944-04-19,San Francisco,California,USA,United States,196.0,86.0,NaN
62678,63144,Keith Notary,1960-01-22,Merritt Island,Florida,USA,United States,170.0,66.0,NaN
77550,78141,Keith Brantly,1962-05-23,Scott Air Force Base,Illinois,USA,United States,180.0,64.0,NaN
84097,84766,Keith Christiansen,1944-07-14,International Falls,Minnesota,USA,United States,165.0,69.0,2018-11-05
94646,95413,Keith Meyer,1938-06-20,Geneva,Illinois,USA,United States,NaN,NaN,2010-07-25
97499,98286,Keith Tkachuk,1972-03-28,Melrose,Massachusetts,USA,United States,188.0,102.0,NaN
98068,98860,Keith Wegeman,1929-08-28,Denver,Colorado,USA,United States,NaN,NaN,1974-08-22
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN

In [ ]:
bios.query('born_country=="USA"') # WECAN FIND THIS BASE ON THIS TOO

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,XÃ³chitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,AngÃ©lica GavaldÃ³n,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145445,149168,Kristen Santos,1994-11-02,Fairfield,Connecticut,USA,United States,NaN,NaN,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN

## ADDING AND REMOVING COLOUMNS

In [103]:
bios.loc[bios['height_cm']>215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,SÃ£o Paulo,SÃ£o Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,MÃ¼nchen (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,KÃ¸benhavn (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,JÄnis KrÅ«miÅ†Å¡,1930-01-30,CÄ“sis,CÄ“su novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,SÃ£o Paulo,SÃ£o Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko VrankoviÄ‡,1964-01-22,DrniÅ¡,Å ibensko-kninska Å¾upanija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Å½ukauskas,1973-08-22,KlaipÄ—da,KlaipÄ—da,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,FrÃ©dÃ©ric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto DueÃ±as,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko BaraÄ‡,1986-08-13,Mostar,HercegovaÄko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,MakiÃ¯vka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,OndÅ™ej BalvÃ­n,1992-09-20,ÃšstÃ­ nad Labem,ÃšsteckÃ½ kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN